# AddInId Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
AddInId Class
Members See Also
---
Identifies an AddIn registered with Revit
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public class AddInId : IDisposable
```

Visual Basic
---
```text
Public Class AddInId _
	Implements IDisposable
```

Visual C++
---
```text
public ref class AddInId : IDisposable
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..AddInId
# See Also
AddInId Members
Autodesk.Revit.DB Namespace